Revit 2027 API
IFCLevelInfo.GetBuildingStorey Method
 Gets the IfcBuildingStorey handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetBuildingStorey()
Public Function GetBuildingStorey As IFCAnyHandle
public:
IFCAnyHandle^ GetBuildingStorey()
member GetBuildingStorey : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The handle.
See Also
Reference
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace